Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/supplementary_welfare_schemes/mortgage_interest_supplement.html.txt.tmx
Source language: en
Languages: ga

source: 25% of all maintenance over €170.23 is also not taken into account
ga: Lena chois sin, ní thógtar 25% de chothabháil ar fad os cionn €170.23 san áireamh

source: Your contribution to mortgage interest (Household Contribution)
ga: Do ranníocaíocht maidir le hús morgáiste (Ranníocaíocht Teaghlaigh)

source: You must pay at least €30 towards your mortgage interest
ga: Ní mór duit ar a laghad €30 a íoc i dtreo d’ús morgáiste

source: You may pay more than €30 because you must also contribute any means you have towards your mortgage interest
ga: Féadfaidh tú breis agus €30 a íoc de bharr nach mór duit cur le haon mhaoin atá agat i dtreo d’ús morgáiste

source: If you are one of a couple and are claiming Mortgage Interest Supplement you must pay at least €40 towards your mortgage interest
ga: Más lánúin thú, agus má tá Forlíonadh Ús Morgáiste á éileamh agat, ní mór duit ar a laghad €40 a íoc i dtreo d’ús morgáiste

source: Calculating Mortgage Interest Supplement
ga: Fordheontas Ús Morgáiste a Ríomh

source: Calculating your Mortgage Interest Supplement can be difficult
ga: Is féidir leis a bheith casta d’Fhordheontas Ús Morgáiste a ríomh

source: The Department of Social Protection's representative (formerly known as the Community Welfare Officer) in your local health centre decides whether you are eligible for Mortgage Interest Supplement and calculates the amount you get
ga: Déanfaidh an tOifigeach Leasa Pobail i d’oifig sláinte áitiúil cinneadh an bhfuil tú incháilithe d’Fhordheontas Ús Morgáiste agus an méid a bheidh le fáil agat a ríomh

source: The Department's representative adds together any income taken into account in the means test for Mortgage Interest Supplement
ga: Suimeoidh an tOifigeach Leasa Pobail (OLP) d’ioncam ar fad le chéile, a thógtar san áireamh sa tástáil mhaoin don Fhordheontas Ús Morgáiste -féach thuas

source: They then subtract any income not taken into account. Your remaining income and Household Contribution are added together to find your contribution to your mortgage interest - see 'Means test' above
ga: Bainfidh an OLP ioncam ar bith nach bhfuil curtha san áireamh ansin Déantar d’ioncam ag Ranníocaíocht Teaghlaigh atá fágtha a shuimiú le chéile chun do ranníocaíocht don ús morgáiste atá agat a fháil - féach thuas

source: Find out more about Calculating Mortgage Interest Supplement
ga: Faigh tuilleadh eolais maidir le conas Forlíonadh Ús Morgáiste a ríomh

source: The Mortgage Interest Supplement payable to you is the difference between your actual mortgage interest and your contribution to mortgage interest, as long as the difference between the two is a reasonable amount to meet your residential needs
ga: An Fordheontas Ús Morgáiste atá iníoctha leat ná an difríocht idir ús morgáiste iarbhír agus do ranníocaíocht don ús morgáiste, cibé fad is méid réasúnach chun do riachtanais cónaithe a freastal é an difríocht

source: Generally the Department's representative will ensure that your income after paying the interest on your mortgage does not fall below a minimum level
ga: Go ginearálta, cinnteoidh an OLP nach dtitfidh d’ioncam, tar éis ús a íoc ar do mhorgáiste, faoi bhun an leibhéil íosmhéide

source: This level is the Supplementary Welfare Allowance minus €30 (€40 for couples)
ga: An leibhéal seo ná Liúntas Leasa Forlíontach lúide €30 ó €40

source: If you are not satisfied with a decision made in relation to Mortgage Interest Supplement, first find out why the decision was made by asking the Department of Social Protection's representative (formerly known as the Community Welfare Officer), who will give you the reasons in writing
ga: Mura bhfuil tú sásta le cinneadh maidir le Fordheontas Ús Morgáiste, faigh amach ar dtús cén fáth atá leis an gcinneadh trí theagmháil a dhéanamh leis an Oifigeach Leasa Pobail, a thabharfaidh na cúiseanna duit i scríbhinn

source: You should provide any extra documentation to back up your case
ga: Má tá cáipéisíocht bhreise ar bith agat mar thacaíocht le do chás, tabhair iad seo don Oifigeach Leasa Pobail

source: If the decision is not changed, you are entitled to have the appeal referred to the Social Welfare Appeals Office
ga: Ina dhiaidh sin, labhair leis an Maoroifigeach Leasa Pobail faoin gcinneadh

source: You can ask for a face-to-face hearing and you can bring along a representative to help you argue your case
ga: Is féidir leo an cinneadh a athrú má thuilleann do chás sin

source: The new income disregards came into effect on 5 June 2007
ga: Tháinig na neamhairdeanna nua ioncaim i bhfeidhm ar 5 Meitheamh 2007

source: Claims made before 5 June 2007 were assessed using the old income disregards (see below)
ga: Measúnaíodh éilimh a rinneadh roimh 5 Meitheamh 2007 ag baint úsáide as na sean-neamhairdeanna ioncaim (féach thíos)

source: All existing Mortgage Interest Supplement claims in payment on 5 June 2007 will be reviewed and assessed using both the current income disegards and the old income disregards
ga: Déanfar gach éileamh ar Fhorlíonadh Úis Mhorgáiste atá á n-íoc faoi láthair ar 5 Meitheamh 2007 a athbhreithniú agus a mheasúnú ag úsáid idir na neamhairdeanna reatha ioncaim agus na sean-neamhairdeanna ioncaim

source: If you would get more Mortgage Interest Supplement using the old income disregards, you will continue to be assessed using the old rules until a change in circumstances triggers a review
ga: Dá bhfaighfeá níos mó Forlíonta Úis Mhorgáiste ag úsáid na sean-neamhairdeanna ioncaim, leanfaidh tú de bheith do do mheasúnú ag úsáid na seanrialacha go dtí go ndéantar athbhreithniú ar do chás mar gheall ar athrú imthosca

source: A change in circumstances would include, for example, a change in household income or a break in your claim for more than 13 weeks
ga: Chuimseodh athrú imthosca, mar shampla, athrú ar ioncam an teaghlaigh nó briseadh i d’éileamh a mhairfeadh níos mó na 13 seachtaine

source: Income disregards for Mortgage Interest Supplement claims before 5 June 2007
ga: Neamhairdeanna ioncaim d’éilimh ar Fhorlíonadh Úis Mhorgáiste roimh 5 Meitheamh 2007

source: Income from the following sources was not taken into account in the assessment of Mortgage Interest Supplement claims made before 5 June 2007:
ga: Níor cuireadh ioncam ó na foinsí seo a leanas san áireamh agus éilimh ar Fhorlíonadh Úis Mhorgáiste a rinneadh roimh 5 Meitheamh 2007 á measúnú:

source: • Foster care payments from the Health Service Executive
ga: • Iocaíochtaí cúraim altrama ó Fheidhmeannacht na Seirbhíse Sláinte

source: • Money received from charitable organizations, for example, St Vincent de Paul
ga: • Airgead a fhaightear ó eagraíochtaí carthanacha, mar shampla, Naomh Uinseann de Pól

source: • Maintenance grants paid by Local Authorities for Higher Education
ga: • Deontais Chothabhála íoctha ag Údaráis Áitiúla don Ardoideachas

source: • €60 of additional income from part-time employment, including Community Employment Schemes
ga: • €60 d’ioncam breise ó fhostaíocht pháirtaimseartha, lena n-áirítear Scéimeanna Fostaíochta Pobail

source: If your earnings from employment are between €60 and €90 only half of your earnings between €60 and €90 is taken into account
ga: Má tá do thuilleamh ón bhfostaíocht idir €60 agus €90 ní ghlactar ach leathchuid de do thuilleamh san áireamh

source: (For example, if you are earning €90 only €15 is taken into account)
ga: (Mar shampla, má tá tú ag tuilleamh €90 ní ghlactar ach €15 san áireamh)

source: • €60 of additional income from participation in approved training courses, for example, FÁS skills training courses
ga: • €60 d’ioncam breise ó pháirteacht i gcúrsaí oiliúna faomhaithe, mar shampla, cúrsaí oiliúna scileanna FÁS

source: If your earnings are between €60 and €90 only half of your earnings between €60 and €90 is taken into account
ga: Má bhíonn do thuilleamh idir €60 agus €90 ní ghlactar san áireamh ach leathchuid de do thuilleamh idir €60 agus €90

source: For example, if you are earning €90 only €15 is taken into account
ga: Mar shampla, má thuilleann tú €90 ní ghlactar san áireamh ach €15

source: • €120 from rehabilitative training or employment if you are in receipt of Disability Allowance
ga: • €120 ó oiliúint nó ó fhostaíocht athshlánúcháin, má bhíonn tú ag fáil Liúntas Míchumais

source: Any earnings over €120 from rehabilitative training or employment will affect your Rent Supplement
ga: Rachaidh aon rud a thuilleann tú thar €120 ó oiliúint nó ó fhostaíocht athshlánúcháin i bhfeidhm ar d’Fhorlíonadh Cíosa

source: • If you are on a One-Parent Family Payment, up to €95.23 of maintenance payments is deemed to be for rent
ga: • Má bhíonn tú ar Íocaíocht do Theaghlach Aontuismitheora, meastar go bhfuil suas le €95.23 d’íocaíochtaí cothabhála le haghaidh cíosa

source: Half of any amount above this is taken into account as means, and will affect your One-Parent Family Payment
ga: Glactar leathchuid d’aon mhéid os a chionn seo san áireamh mar acmhainn, agus rachaidh sé i bhfeidhm ar d’Íocaíocht Aontuismitheora

source: The first €95.23 of any maintenance you receive is taken into account when calculating your Rent Supplement, but maintenance above €95.23 euro up to a limit of €155.23 is disregarded. Half of any maintenance you get between €155.23 and €185.23 is taken into account
ga: Glactar an chéad €95.23 d’aon chothabháil a fhaigheann tú san áireamh agus d’Fhorlíonadh Cíosa a ríomh, ach déantar neamhaird ar chothabháil os cionn €185.23 agus d’Fhorlíonadh Cíosa á ríomh
